
Процедура ВКМ_ОтправкаСообщенийВТелеграм() Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Сообщение
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий()Цикл
	
	Сообщение = Выборка.Сообщение.ПолучитьОбъект();
	
	ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	
	ИнтернетПрокси.Установить("https","87.251.77.29",3128, "", "", Ложь);
	
	Соединение  =  Новый HTTPСоединение("api.telegram.org",443,,,ИнтернетПрокси,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	АдресРесурса = СтрШаблон("/bot%1/sendMessage", Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить());
	
	Запрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	
	ИДЧата = Число(Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить());
	 
	СтрукЗапроса = Новый Структура("chat_id, text", ИДЧата, Сообщение.ТекстСообщения);
	ТелоЗапроса = ОбщегоНазначения.ЗначениеВJSON(СтрукЗапроса);
	Запрос.УстановитьТелоИзСтроки(Телозапроса);
	
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		Сообщение.Удалить();
	Иначе
		ЗаписьЖурналаРегистрации("Отправка сообщения в телеграм", УровеньЖурналаРегистрации.Ошибка,
		Сообщение.Ссылка, Ответ.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры
