
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПериодРегистрации = НачалоМесяца(Дата);
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	МассивСотрудников = Новый Массив;
	
	Для Каждого Строка Из ДополнительныеНачисления Цикл
		
		Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия Тогда
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			Движение.ПериодРегистрации = ПериодРегистрации;
			ЗаполнитьЗначенияСвойств(Движение, Строка);
			Движение.Результат = Строка.Сумма;
		КонецЕсли;
		
		Удержание = Движения.ВКМ_Удержания.Добавить();
		Удержание.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Удержание.ПериодРегистрации = ПериодРегистрации;
		Удержание.Сотрудник = Строка.Сотрудник;
		Удержание.БазовыйПериодНачало = ПериодРегистрации;
		Удержание.БазовыйПериодКонец = КонецМесяца(ПериодРегистрации);
		Удержание.ВидРасчетаБазовый = Строка.ВидРасчета;
		
	КонецЦикла;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_СтавкиНДФЛСрезПоследних.РазмерСтавкиНДФЛ КАК РазмерСтавкиНДФЛ
	|ПОМЕСТИТЬ ВТ_СтавкаНДФЛ
	|ИЗ
	|	РегистрСведений.ВКМ_СтавкиНДФЛ.СрезПоследних(&ПериодРегистрации,) КАК ВКМ_СтавкиНДФЛСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза КАК РезультатБаза,
	|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Результат КАК Результат,
	|	ВТ_СтавкаНДФЛ.РазмерСтавкиНДФЛ КАК РазмерСтавкиНДФЛ,
	|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.ВидРасчетаБазовый КАК ВидРасчетаБазовый,
	|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.ВидРасчетаРазрез КАК ВидРасчетаРазрез
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения, &Разрезы,
	|		Регистратор = &Регистратор) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтавкаНДФЛ КАК ВТ_СтавкаНДФЛ
	|		ПО ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.НомерСтроки КАК НомерСтроки,
	|	ВТ_Итог.РезультатБаза КАК РезультатБаза,
	|	ВТ_Итог.Результат КАК Результат,
	|	ВТ_Итог.РазмерСтавкиНДФЛ КАК РазмерСтавкиНДФЛ,
	|	ВТ_Итог.Сотрудник КАК Сотрудник
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|ГДЕ
	|	ВТ_Итог.ВидРасчетаБазовый = ВТ_Итог.ВидРасчетаРазрез";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", Периодрегистрации);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Разрезы = Новый Массив;
	Разрезы.Добавить("ВидРасчета");
	Запрос.УстановитьПараметр("Разрезы", Разрезы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Движение Из Движения.ВКМ_Удержания Цикл
		
		Выборка.Сбросить();
		
		Если Выборка.НайтиСледующий(Новый Структура("НомерСтроки", Движение.НомерСтроки)) Тогда
		
			Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ Тогда
			
				Движение.Результат = Выборка.РезультатБаза * Выборка.РазмерСтавкиНДФЛ / 100;
				Движение.ПроцентНДФЛ = Выборка.РазмерСтавкиНДФЛ;
				Движение.СуммаДоУдержания = Выборка.РезультатБаза;
			
			КонецЕсли;
		
		КонецЕсли;
		
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
		Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_ДополнительныеНачисления.Результат) КАК ДополнительныеНачисления
	|ПОМЕСТИТЬ ВТ_ДополнительныеНачисления
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|ГДЕ
	|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ДополнительныеНачисления.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_Удержания.Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_Удержания.Результат) КАК Удержания
	|ПОМЕСТИТЬ ВТ_Удержания
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	|ГДЕ
	|	ВКМ_Удержания.Регистратор = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_Удержания.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	|	ВТ_ДополнительныеНачисления.ДополнительныеНачисления КАК ДополнительныеНачисления,
	|	ЕСТЬNULL(ВТ_Удержания.Удержания, 0) КАК Удержания
	|ИЗ
	|	ВТ_ДополнительныеНачисления КАК ВТ_ДополнительныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Удержания КАК ВТ_Удержания
	|		ПО ВТ_ДополнительныеНачисления.Сотрудник = ВТ_Удержания.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.ДополнительныеНачисления - Выборка.Удержания;
		
	КонецЦикла;
	
КонецПроцедуры
