Процедура СоздатьАктыПоДоговорам(Параметры, АдресРезультата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Владелец КАК Владелец,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ОтборДоговоров
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОтборДоговоров.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL КАК СоздатьДокумент,
	|	ВТ_ОтборДоговоров.Владелец КАК Контрагент,
	|	ВТ_ОтборДоговоров.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_ОтборДоговоров КАК ВТ_ОтборДоговоров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_ОтборДоговоров.Ссылка = РеализацияТоваровУслуг.Договор
	|		И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.Ссылка КАК Договор
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|ГДЕ
	|	ВТ_Итог.СоздатьДокумент";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("ДатаНачала", Параметры.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Параметры.ДатаОкончания);
	
	ТабДоговоров = Запрос.Выполнить().Выгрузить();
	
	ВсегоДоговоров = ТабДоговоров.Количество();
	
	ТекДок = 1;
	
	Для Каждого Строка Из ТабДоговоров Цикл
		
		НовДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		
		НовДок.Заполнить(Строка.Договор);
		НовДок.Дата = Параметры.ДатаОкончания;
		НовДок.ВыполнитьАвтозаполнение();
		НовДок.Основание = Строка.Договор;
		
		ОшибокНет = НовДок.ПроверитьЗаполнение();
		
		Если ОшибокНет Тогда
			НовДок.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		ПроцентВыполнения = (ТекДок/ВсегоДоговоров)*100;
		ПроцентВыполнения = Окр(ПроцентВыполнения,0);
		
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения,СокрЛП(НовДок.Ссылка));
		
		ТекДок = ТекДок + 1;
		
	КонецЦикла;
	
КонецПроцедуры