Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, Сотрудник) Экспорт 
	
	Набор = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	
	Набор.Отбор.Сотрудник.Установить(Сотрудник);
	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	
	Пока Дат <= ДатаОкончания Цикл
		
		Если Не Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
				
				Запись = Набор.Добавить();
				Запись.Сотрудник = Сотрудник;
				Запись.Дата = Дат;
				Запись.Значение = 1;
				
		КонецЕсли;
		
		Дат = Дат + ЧислоСекундВСутках;
				
	КонецЦикла;
		
	Набор.Записать();
	
КонецПроцедуры
