
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ТекстСообщения = "";
	
	Если ЭтоНовый() Тогда
		
		ТекстСообщения = "Создан новый документ ""Обслуживание клиента"" " + Номер + " от " + Дата;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот КАК ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот КАК ВремяОкончанияРабот,
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		Если Выборка.ДатаПроведенияРабот <> ДатаПроведенияРабот Тогда
			ТекстСообщения = "Изменена дата проведения работ в документе 
			|""Обслуживание клиента"" " + Номер + " от " + Дата;
		КонецЕсли;
		
		Если Выборка.ВремяНачалаРабот <> ВремяНачалаРабот Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + 
			"Изменено время начала работ в документе ""Обслуживание клиента"" " + Номер + " от " + Дата;
		КонецЕсли;
		
		Если Выборка.ВремяОкончанияРабот <> ВремяОкончанияРабот Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС +
			"Изменено время окончания работ в документе ""Обслуживание клиента"" " + Номер + " от " + Дата;
		КонецЕсли;
		
		Если Выборка.Специалист <> Специалист Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + 
			"Изменен специалист в документе ""Обслуживание клиента"" " + Номер + " от " + Дата;
		КонецЕсли;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		
		НовоеСообщение = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НовоеСообщение.ТекстСообщения = ТекстСообщения;
		НовоеСообщение.Записать();
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ,Режим)

	СтрукДоговора = ПолучитьСтруктуруДоговора();
	
	СтавкаСотрудника = ПолучитьСтавкуСотрудника();
	
	Если СтавкаСотрудника = Неопределено Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("На момент проведения для сотрудника не указана ставка!");
	КонецЕсли;
	
	Если Не Отказ Тогда
		
	Если СтрукДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание Тогда
		
		Если СтрукДоговора.ДатаНачала <= ДатаПроведенияРабот И СтрукДоговора.ДатаОкончания > ДатаПроведенияРабот Тогда
			СформироватьДвиженияПоВыполненнымРаботам(СтрукДоговора, СтавкаСотрудника);
		Иначе
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Срок действия договора не соответствует дате проведения работ!");
		КонецЕсли;
	
	Иначе
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Вид договора должен соответствовать абонентской плате!");
	КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияПоВыполненнымРаботам(СтрукДоговора, СтавкаСотрудника)

	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Для Каждого ТекСтрокаВыполненныеРаботы из ВыполненныеРаботы Цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = Движение.КоличествоЧасов * СтрукДоговора.СтавкаЧаса;
		
		ДвижениеСотрудник = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		ДвижениеСотрудник.Период = Дата;
		ДвижениеСотрудник.Сотрудник = Специалист;
		ДвижениеСотрудник.ЧасовКОплате = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
		ДвижениеСотрудник.СуммаКОплате = Движение.СуммаКОплате * СтавкаСотрудника / 100;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтавкуСотрудника()
	
	Ставка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК
	|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Ставка = Выборка.ПроцентОтРабот;
	КонецЕсли;
	
	Возврат Ставка;
	
КонецФункции

Функция ПолучитьСтруктуруДоговора()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВКМ_ПериодДействияНачало КАК ДатаНачала,
	|	ДоговорыКонтрагентов.ВКМ_ПериодДействияКонец КАК ДатаОкончания,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтавкаЧаса,
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Договор";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;

КонецФункции



