
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВКМ_УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
//++ВКМ(ДОБАВЛЕНИЕ), Самжилин Д.Р., 07.07.2026
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВКМ_ДобавитьЭлементыНаФорму();
КонецПроцедуры//--ВКМ(Конец ДОБАВЛЕНИЯ), Самжилин Д.Р., 07.07.2026

&НаСервере
//++ВКМ(ДОБАВЛЕНИЕ), Самжилин Д.Р., 07.07.2026
Процедура ВКМ_ДобавитьЭлементыНаФорму()
	
	ГруппаПериод = Элементы.Добавить("ГруппаПериод", Тип("ГруппаФормы"));
	ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериод.ОтображатьЗаголовок = Ложь;
	ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ЭлементПериодНачало = Элементы.Добавить("ВКМ_ПериодДействияНачало", Тип("ПолеФормы"), Элементы.ГруппаПериод);
	ЭлементПериодНачало.ПутьКДанным = "Объект.ВКМ_ПериодДействияНачало";
	ЭлементПериодНачало.Вид = ВидПоляФормы.ПолеВвода;
	
	ЭлементПериодКонец = Элементы.Добавить("ВКМ_ПериодДействияКонец", Тип("ПолеФормы"), Элементы.ГруппаПериод);
	ЭлементПериодКонец.ПутьКДанным = "Объект.ВКМ_ПериодДействияКонец";
	ЭлементПериодКонец.Вид = ВидПоляФормы.ПолеВвода;
	
	ГруппаПлата = Элементы.Добавить("ГруппаПлата", Тип("ГруппаФормы"));
	ГруппаПлата.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПлата.ОтображатьЗаголовок = Ложь;
	ГруппаПлата.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ЭлементПлата = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), Элементы.ГруппаПлата);
	ЭлементПлата.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ЭлементПлата.Вид = ВидПоляФормы.ПолеВвода;
	
	ЭлементСтоимостьЧас = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), Элементы.ГруппаПлата);
	ЭлементСтоимостьЧас.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	ЭлементСтоимостьЧас.Вид = ВидПоляФормы.ПолеВвода;
	
	ВКМ_УстановитьВидимостьЭлементов();
	
КонецПроцедуры//--ВКМ(Конец ДОБАВЛЕНИЯ), Самжилин Д.Р., 07.07.2026

&НаСервере
//++ВКМ(ДОБАВЛЕНИЕ), Самжилин Д.Р., 07.07.2026
Процедура ВКМ_УстановитьВидимостьЭлементов()
	
	ЭтоАбонентскоеОбслуживание = Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание;
	
	Элементы.ВКМ_ПериодДействияНачало.Видимость        = ЭтоАбонентскоеОбслуживание;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = ЭтоАбонентскоеОбслуживание;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость   = ЭтоАбонентскоеОбслуживание;
	
КонецПроцедуры//--ВКМ(Конец ДОБАВЛЕНИЯ), Самжилин Д.Р., 07.07.2026