
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Для Каждого Строка Из Выплаты Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Сумма = Строка.Сумма;
		
	КонецЦикла;
	
	Движения.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.БлокироватьДляИзменения = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ВыплатаЗарплатыВыплаты.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_ОтборСотрудников
	|ИЗ
	|	Документ.ВКМ_ВыплатаЗарплаты.Выплаты КАК ВКМ_ВыплатаЗарплатыВыплаты
	|ГДЕ
	|	ВКМ_ВыплатаЗарплатыВыплаты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Граница, Сотрудник В
	|		(ВЫБРАТЬ
	|			ВТ_ОтборСотрудников.Сотрудник КАК Сотрудник
	|		ИЗ
	|			ВТ_ОтборСотрудников КАК ВТ_ОтборСотрудников)) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.Сотрудник КАК Сотрудник,
	|	ВТ_Остатки.СуммаОстаток КАК СуммаОстаток,
	|	ВТ_Остатки.Сотрудник.Представление КАК СотрудникПредставление
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|ГДЕ
	|	ВТ_Остатки.СуммаОстаток < 0";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Отказ = Истина;
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("У сотрудника %1 назначена выплата больше, чем начислено.", 
			Выборка.СотрудникПредставление));
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
