
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	ПериодРегистрации = НачалоМесяца(Дата);
	
	Для Каждого Строка Из ОсновныеНачисления Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.ПериодДействияНачало = Строка.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(Строка.ДатаОкончания);
		
		Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			
			Движение.БазовыйПериодНачало = ДобавитьМесяц(ПериодРегистрации, -12);
			Движение.БазовыйПериодКонец = ПериодРегистрации;
			
		КонецЕсли;
		
			Удержание = Движения.ВКМ_Удержания.Добавить();
			Удержание.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
			Удержание.ПериодРегистрации = ПериодРегистрации;
			Удержание.Сотрудник = Строка.Сотрудник;
			Удержание.БазовыйПериодНачало = ПериодРегистрации;
			Удержание.БазовыйПериодКонец = КонецМесяца(ПериодРегистрации);
			Удержание.ВидРасчетаБазовый = Строка.ВидРасчета;
		
	КонецЦикла;
	
	Для Каждого Строка Из ДополнительныеНачисления Цикл
		
		Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Сделка Тогда
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Строка);
			Движение.ПериодРегистрации = ПериодРегистрации;
		КонецЕсли;
		
			Удержание = Движения.ВКМ_Удержания.Добавить();
			Удержание.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
			Удержание.ПериодРегистрации = ПериодРегистрации;
			Удержание.Сотрудник = Строка.Сотрудник;
			Удержание.БазовыйПериодНачало = ПериодРегистрации;
			Удержание.БазовыйПериодКонец = КонецМесяца(ПериодРегистрации);
			Удержание.ВидРасчетаБазовый = Строка.ВидРасчета;
		
	КонецЦикла;
	
	Движения.Записать();
	
	Движения.ВКМ_НачислениеОтпуска.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_ОтборСотрудников
	|ИЗ
	|	Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачисления КАК ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления
	|ГДЕ
	|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ПОМЕСТИТЬ ВТ_Оклады
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ПериодРегистрации, Сотрудник В
	|		(ВЫБРАТЬ
	|			ВТ_ОтборСотрудников.Сотрудник КАК Сотрудник
	|		ИЗ
	|			ВТ_ОтборСотрудников КАК ВТ_ОтборСотрудников)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК КоличествоРабочихДней,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК ОтработаноДней,
	|	ЕСТЬNULL(ВТ_Оклады.Оклад, 0) КАК Оклад,
	|	NULL КАК РезультатБаза,
	|	NULL КАК ОтработаноДнейБаза
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
	|	И ВидРасчета = &ВидРасчетаОклад) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Оклады КАК ВТ_Оклады
	|		ПО ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник = ВТ_Оклады.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки,
	|	NULL,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия,
	|	NULL,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0),
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ОтработаноДнейБаза, 0)
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
	|	И ВидРасчета = &ВидРасчетаОтпуск) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения,,
	|			Регистратор = &Ссылка
	|		И ВидРасчета = &ВидРасчетаОтпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
	|		ПО ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки";
	
	Запрос.УстановитьПараметр("ВидРасчетаОклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчетаОтпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
		Для Каждого Движение Из Движения.ВКМ_ОсновныеНачисления Цикл
			
			Выборка.Сбросить();
			Выборка.НайтиСледующий(Новый Структура("НомерСтроки", Движение.НомерСтроки));
				
			Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
				Движение.Результат = ?(Выборка.КоличествоРабочихДней <> 0,
				Выборка.Оклад / Выборка.КоличествоРабочихДней * Выборка.ОтработаноДней, 0);
				ЗаполнитьЗначенияСвойств(Движение, Выборка);
			ИначеЕсли Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
				Движение.ОтработаноДней = Выборка.ОтработаноДней;
				Движение.Результат = ?(Выборка.ОтработаноДнейБаза <> 0, 
				Выборка.РезультатБаза / Выборка.ОтработаноДнейБаза * Выборка.ОтработаноДней, 0);
				
				Отпуск = Движения.ВКМ_НачислениеОтпуска.ДобавитьРасход();
				Отпуск.Период = Дата;
				Отпуск.Сотрудник = Движение.Сотрудник;
				Отпуск.КоличествоДней = Выборка.ОтработаноДней;
				
			КонецЕсли;
		
		КонецЦикла;
		
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина, , );
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_НачислениеЗаработнойПлатыДополнительныеНачисления.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_ОтборСотрудников
	|ИЗ
	|	Документ.ВКМ_НачислениеЗаработнойПлаты.ДополнительныеНачисления КАК
	|		ВКМ_НачислениеЗаработнойПлатыДополнительныеНачисления
	|ГДЕ
	|	ВКМ_НачислениеЗаработнойПлатыДополнительныеНачисления.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник, 0) КАК Сотрудник,
	|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот, 0) КАК СуммаКОплатеОборот,
	|	ВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода,,
	|			Сотрудник В
	|			(ВЫБРАТЬ
	|				ВТ_ОтборСотрудников.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТ_ОтборСотрудников КАК ВТ_ОтборСотрудников)) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	|		ПО ВКМ_ДополнительныеНачисления.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
	|ГДЕ
	|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НачалоПериода", ПериодРегистрации);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодРегистрации));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Движение Из Движения.ВКМ_ДополнительныеНачисления Цикл
			
			Выборка.Сбросить();
			Выборка.НайтиСледующий(Новый Структура("НомерСтроки", Движение.НомерСтроки));
				
			Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Сделка Тогда
				Движение.Результат = Выборка.СуммаКОплатеОборот;
			КонецЕсли;
		
	КонецЦикла;	
		
	Движения.ВКМ_ДополнительныеНачисления.Записать();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_СтавкиНДФЛСрезПоследних.РазмерСтавкиНДФЛ КАК РазмерСтавкиНДФЛ
	|ПОМЕСТИТЬ ВТ_СтавкаНДФЛ
	|ИЗ
	|	РегистрСведений.ВКМ_СтавкиНДФЛ.СрезПоследних(&ПериодРегистрации,) КАК ВКМ_СтавкиНДФЛСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза КАК РезультатБаза,
	|	ВТ_СтавкаНДФЛ.РазмерСтавкиНДФЛ КАК РазмерСтавкиНДФЛ,
	|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.ВидРасчетаРазрез КАК ВидРасчетаРазрез,
	|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.ВидРасчетаБазовый КАК ВидРасчетаБазовый
	|ПОМЕСТИТЬ ВТ_ИтогОсновные
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения, &Разрезы,
	|		Регистратор = &Регистратор) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтавкаНДФЛ КАК ВТ_СтавкаНДФЛ
	|		ПО ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза КАК РезультатБаза,
	|	ВТ_СтавкаНДФЛ.РазмерСтавкиНДФЛ КАК РазмерСтавкиНДФЛ,
	|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.ВидРасчетаРазрез КАК ВидРасчетаРазрез,
	|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.ВидРасчетаБазовый КАК ВидРасчетаБазовый
	|ПОМЕСТИТЬ ВТ_ИтогДоп
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения, &Разрезы,
	|		Регистратор = &Регистратор) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтавкаНДФЛ КАК ВТ_СтавкаНДФЛ
	|		ПО ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.НомерСтроки КАК НомерСтроки,
	|	ВТ_Итог.РезультатБаза КАК РезультатБаза,
	|	ВТ_Итог.РазмерСтавкиНДФЛ КАК РазмерСтавкиНДФЛ,
	|	ВТ_Итог.ВидРасчетаРазрез КАК ВидРасчетаРазрез,
	|	ВТ_Итог.ВидРасчетаБазовый КАК ВидРасчетаБазовый
	|ИЗ
	|	ВТ_ИтогОсновные КАК ВТ_Итог
	|ГДЕ
	|	ВТ_Итог.ВидРасчетаРазрез = ВТ_Итог.ВидРасчетаБазовый
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИтогДоп.НомерСтроки,
	|	ВТ_ИтогДоп.РезультатБаза,
	|	ВТ_ИтогДоп.РазмерСтавкиНДФЛ,
	|	ВТ_ИтогДоп.ВидРасчетаРазрез,
	|	ВТ_ИтогДоп.ВидРасчетаБазовый
	|ИЗ
	|	ВТ_ИтогДоп КАК ВТ_ИтогДоп
	|ГДЕ
	|	ВТ_ИтогДоп.ВидРасчетаРазрез = ВТ_ИтогДоп.ВидРасчетаБазовый";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", Периодрегистрации);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Разрезы = Новый Массив;
	Разрезы.Добавить("ВидРасчета");
	Запрос.УстановитьПараметр("Разрезы", Разрезы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Движение Из Движения.ВКМ_Удержания Цикл
		
		Выборка.Сбросить();
		
		Если Выборка.НайтиСледующий(Новый Структура("НомерСтроки", Движение.НомерСтроки)) Тогда
		
			Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ Тогда
			
				Движение.Результат = Выборка.РезультатБаза * Выборка.РазмерСтавкиНДФЛ / 100;
				Движение.ПроцентНДФЛ = Выборка.РазмерСтавкиНДФЛ;
				Движение.СуммаДоУдержания = Выборка.РезультатБаза;
			
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_ОсновныеНачисления.Результат) КАК ОсновныеНачисления
	|ПОМЕСТИТЬ ВТ_ОсновныеНачисления
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|ГДЕ
	|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОсновныеНачисления.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_ДополнительныеНачисления.Результат) КАК ДополнительныеНачисления
	|ПОМЕСТИТЬ ВТ_ДополнительныеНачисления
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|ГДЕ
	|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ДополнительныеНачисления.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_Удержания.Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_Удержания.Результат) КАК Удержания
	|ПОМЕСТИТЬ ВТ_Удержания
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	|ГДЕ
	|	ВКМ_Удержания.Регистратор = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_Удержания.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	ВТ_ОсновныеНачисления.ОсновныеНачисления КАК ОсновныеНачисления,
	|	ЕСТЬNULL(ВТ_ДополнительныеНачисления.ДополнительныеНачисления, 0) КАК ДополнительныеНачисления,
	|	ЕСТЬNULL(ВТ_Удержания.Удержания, 0) КАК Удержания
	|ИЗ
	|	ВТ_ОсновныеНачисления КАК ВТ_ОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДополнительныеНачисления КАК ВТ_ДополнительныеНачисления
	|		ПО ВТ_ОсновныеНачисления.Сотрудник = ВТ_ДополнительныеНачисления.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Удержания КАК ВТ_Удержания
	|		ПО ВТ_ОсновныеНачисления.Сотрудник = ВТ_Удержания.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.ОсновныеНачисления + Выборка.ДополнительныеНачисления - Выборка.Удержания;
		
	КонецЦикла;
	
КонецПроцедуры
